In [1]:
!pip install pandas

Requirement already satisfied: pandas in f:\new folder\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in f:\new folder\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in f:\new folder\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in f:\new folder\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in f:\new folder\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in f:\new folder\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd
#dataframe create

In [3]:
df=pd.DataFrame([1,2,3])
print(df)

   0
0  1
1  2
2  3

In [4]:
data={
      "Name":["abid alam","salahuddin","ahsan"],
      "age":[34,23,77],
      "sallerry":[12000,65777,67667] 
}

In [5]:
df=pd.DataFrame(data)
print(df)

         Name  age  sallerry
0   abid alam   34     12000
1  salahuddin   23     65777
2       ahsan   77     67667

In [6]:
df.head(4)

         Name  age  sallerry
0   abid alam   34     12000
1  salahuddin   23     65777
2       ahsan   77     67667

In [7]:
df.tail(1)

    Name  age  sallerry
2  ahsan   77     67667

In [8]:
df.shape

(3, 3)

In [9]:
df.columns

Index(['Name', 'age', 'sallerry'], dtype='object')

In [10]:
df.rename(columns={"sallerry": "salary"},inplace=True)

In [11]:
df

         Name  age  salary
0   abid alam   34   12000
1  salahuddin   23   65777
2       ahsan   77   67667

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   age     3 non-null      int64
 2   salary  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [13]:
df.describe()

             age        salary
count   3.000000      3.000000
mean   44.666667  48481.333333
std    28.536526  31607.891204
min    23.000000  12000.000000
25%    28.500000  38888.500000
50%    34.000000  65777.000000
75%    55.500000  66722.000000
max    77.000000  67667.000000

In [14]:
#save and load data fram csv

In [15]:
df

         Name  age  salary
0   abid alam   34   12000
1  salahuddin   23   65777
2       ahsan   77   67667

In [16]:
df.to_csv("test_data.csv",index=False)

In [17]:
import os
os.getcwd()

'C:\\Users\\HB LAPTOP POINT'

In [18]:
load_df=pd.read_csv("test_data.csv")
load_df

         Name  age  salary
0   abid alam   34   12000
1  salahuddin   23   65777
2       ahsan   77   67667

In [19]:
  #row coliumns selections
df[["Name"]]

         Name
0   abid alam
1  salahuddin
2       ahsan

In [20]:
df.loc[df.Name=="abid alam"]

        Name  age  salary
0  abid alam   34   12000

In [24]:
df.loc[(df.Name=="abid alam")& (df.salary>=10000)]

        Name  age  salary
0  abid alam   34   12000

In [27]:
df.loc[0:2]

         Name  age  salary
0   abid alam   34   12000
1  salahuddin   23   65777
2       ahsan   77   67667

In [26]:
# df.iloc[0]
df.iloc[0:2]

         Name  age  salary
0   abid alam   34   12000
1  salahuddin   23   65777

In [28]:
 df

         Name  age  salary
0   abid alam   34   12000
1  salahuddin   23   65777
2       ahsan   77   67667

In [32]:
df_age_filter=df[df["age"]>30]

In [33]:
df_age_filter

        Name  age  salary
0  abid alam   34   12000
2      ahsan   77   67667

In [36]:
df[(df["age"]>=30)& (df["salary"]>=67000)]

    Name  age  salary
2  ahsan   77   67667

In [40]:
df["Team"]=["CEO","HR","DA"]
df

         Name  age  salary Team
0   abid alam   34   12000  CEO
1  salahuddin   23   65777   HR
2       ahsan   77   67667   DA

In [42]:
df["bonus"]=df["salary"]*0.2
df

         Name  age  salary Team    bonus
0   abid alam   34   12000  CEO   2400.0
1  salahuddin   23   65777   HR  13155.4
2       ahsan   77   67667   DA  13533.4

In [46]:
df.loc[len(df)]=["abc",33,4567,"DA",3444]
df

         Name  age  salary Team    bonus
0   abid alam   34   12000  CEO   2400.0
1  salahuddin   23   65777   HR  13155.4
2       ahsan   77   67667   DA  13533.4
3         abc   33    4567   DA   3444.0

In [2]:
%history -f main1.py